sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_LPI2C.h
/***********************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, Rütihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher
    
    ---------------------------------------------------------------------
    File:      kinetis_LPI2C.h
    Project:   Single Chip Embedded Internet
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2020
    *********************************************************************
    20.02.2018 Enable ignoring Nacks to allow compatible operation with other I2C controllers {1}
    24.03.2019 Add DMA mode and I2C_2_BYTE_LENGTH option
    08.12.2019 Share LPI2C driver with iMX project
    06.02.2020 Clear flags before sending a new address in case following a non-acked transfer {2}
    16.11.2020 I2C simulation extended to support multiple I2C buses     {3}

*/

/* =================================================================== */
/*                             constants                               */
/* =================================================================== */

#if defined I2C_DMA_SUPPORT                                              // DMA support on transmission
// DMA channel assignments for each LPI2C transmitter
//
static const unsigned char LPI2C_DMA_TX_CHANNEL[LPI2C_AVAILABLE] = {
    DMA_I2C0_TX_CHANNEL, 
    #if (LPI2C_AVAILABLE) > 1
    DMA_I2C1_TX_CHANNEL,
    #endif
    #if (LPI2C_AVAILABLE) > 2
    DMA_I2C2_TX_CHANNEL, 
    #endif
    #if (LPI2C_AVAILABLE) > 3
    DMA_I2C3_TX_CHANNEL,
    #endif
};

// DMA channel assignments for each LPI2C receiver
//
static const unsigned char LPI2C_DMA_RX_CHANNEL[LPI2C_AVAILABLE] = {
    DMA_I2C0_RX_CHANNEL,
    #if (LPI2C_AVAILABLE) > 1
    DMA_I2C1_RX_CHANNEL,
    #endif
    #if (LPI2C_AVAILABLE) > 2
    DMA_I2C2_RX_CHANNEL,
    #endif
    #if (LPI2C_AVAILABLE) > 3
    DMA_I2C3_RX_CHANNEL,
    #endif
};

// DMA channel interrupt priority assignments for each LPI2C transmitter
//
static const unsigned char LPI2C_DMA_TX_INT_PRIORITY[LPI2C_AVAILABLE] = {
    DMA_I2C0_TX_INT_PRIORITY, 
    #if (LPI2C_AVAILABLE) > 1
    DMA_I2C1_TX_INT_PRIORITY, 
    #endif
    #if (LPI2C_AVAILABLE) > 2
    DMA_I2C2_TX_INT_PRIORITY, 
    #endif
    #if (LPI2C_AVAILABLE) > 3
    DMA_I2C3_TX_INT_PRIORITY,
    #endif
};

// DMA channel interrupt priority assignments for each LPI2C receiver
//
static const unsigned char LPI2C_DMA_RX_INT_PRIORITY[LPI2C_AVAILABLE] = {
    DMA_I2C0_RX_INT_PRIORITY,
    #if (LPI2C_AVAILABLE) > 1
    DMA_I2C1_RX_INT_PRIORITY,
    #endif
    #if (LPI2C_AVAILABLE) > 2
    DMA_I2C2_RX_INT_PRIORITY,
    #endif
    #if (LPI2C_AVAILABLE) > 3
    DMA_I2C3_RX_INT_PRIORITY,
    #endif
};
#endif
/* =================================================================== */
/*                 local function prototype declarations               */
/* =================================================================== */

static void fnConfigLPI2C_pins(QUEUE_HANDLE Channel,  int iMaster);

/* =================================================================== */
/*                      local variable definitions                     */
/* =================================================================== */

static unsigned char ucCheckTxI2C = 0;                                   // {2}
#if defined I2C_SLAVE_MODE
    static unsigned char *ptrMessage[LPI2C_AVAILABLE] = {0};
    static unsigned char ucMessageLength[LPI2C_AVAILABLE] = {0};
    static int (*fnI2C_SlaveCallback[LPI2C_AVAILABLE])(int iChannel, unsigned char *ptrDataByte, int iType) = {0};
#endif

/* =================================================================== */
/*                     global variable definitions                     */
/* =================================================================== */

#if defined I2C_INTERFACE
    extern I2CQue *I2C_rx_control[LPI2C_AVAILABLE];
    extern I2CQue *I2C_tx_control[LPI2C_AVAILABLE];
#endif

/* =================================================================== */
/*                        I2C Interrupt Handlers                       */
/* =================================================================== */


//#define MAX_EVENTS 200                                               // comment this in to enable event logging
#if defined MAX_EVENTS
unsigned long ulTemp[LPI2C_AVAILABLE][MAX_EVENTS] = {{0}};
int iEventCounter[LPI2C_AVAILABLE] = {0};

static void fnLogEvent(int iChannel, unsigned char ucLocation, unsigned long ulValue)
{
    if (iEventCounter[iChannel] < (MAX_EVENTS - 2)) {
        ulTemp[iChannel][iEventCounter[iChannel]++] = ucLocation;
        ulTemp[iChannel][iEventCounter[iChannel]++] = ulValue;
    }
}

extern void fnPrintLPI2C(int iChannel)
{
    CHAR cLocation[2];
    int iEvent = 0;
    if (iChannel >= LPI2C_AVAILABLE) {
        fnDebugMsg("Invalid LPI2C channel!\r\n");
        return;
    }
    fnDebugMsg("LPI2C Channel");
    fnDebugDec(iChannel, (WITH_LEADIN | WITH_CR_LF));
    cLocation[1] = 0;
    while (iEvent < (MAX_EVENTS - 2)) {
        cLocation[0] = (CHAR)ulTemp[iChannel][iEvent++];
        if (cLocation[0] == 0) {
            break;
        }
        fnDebugMsg(cLocation);
        fnDebugHex(ulTemp[iChannel][iEvent++], (sizeof(ulTemp[iChannel][iEvent]) | WITH_SPACE | WITH_LEADIN | WITH_CR_LF));

    }
    fnDebugMsg("End\r\n");
}
#else
    #define fnLogEvent(x, y, z)                                          // dummy when logging is disabled
extern void fnPrintLPI2C(int iChannel)
{
    fnDebugMsg("Not enabled\r\n");
}
#endif

#if defined I2C_SLAVE_MODE
    #if defined I2C_SLAVE_RX_BUFFER
static int fnSaveRx(I2CQue *ptrRxControl, unsigned char ucRxByte)
{
    fnLogEvent(0, 'r', ucRxByte);
    if (ptrRxControl->I2C_queue.chars < ptrRxControl->I2C_queue.buf_length) { // ensure there is space in the input buffer
        *ptrRxControl->I2C_queue.put = ucRxByte;                         // save the received byte
        ptrRxControl->I2C_queue.chars++;                                 // increment the character count
        if (++(ptrRxControl->I2C_queue.put) >= ptrRxControl->I2C_queue.buffer_end) { // handle circular input buffer
            ptrRxControl->I2C_queue.put = ptrRxControl->I2C_queue.QUEbuffer;
        }
        return 0;                                                        // received byte was saved
    }
    else {
        return -1;                                                       // the received byte wasn't saved
    }
}
    #endif

static unsigned char fnGetTxByte(int iChannel, I2CQue *ptrTxControl, int iType)
{
    #if defined I2C_SLAVE_TX_BUFFER
    int iResult = I2C_SLAVE_BUFFER;
    #endif
    unsigned char ucByte = 0xff;                                         // default in case there is no defined data to return
    if (fnI2C_SlaveCallback[iChannel] != 0) {                            // if there is a callback
        #if defined I2C_SLAVE_TX_BUFFER
        iResult = fnI2C_SlaveCallback[iChannel](iChannel, &ucByte, iType);
        #else
        fnI2C_SlaveCallback[iChannel](iChannel, &ucByte, iType);
        #endif
    }
    #if defined I2C_SLAVE_TX_BUFFER
    if (I2C_SLAVE_BUFFER == iResult) {                                   // extract the data from the buffer
        if (ptrTxControl != 0) {
            if (ptrTxControl->I2C_queue.chars != 0) {                    // if there is data in the queue
                ucByte = *(ptrTxControl->I2C_queue.get);                 // the next byte to send is taken from the queue
                if (++(ptrTxControl->I2C_queue.get) >= ptrTxControl->I2C_queue.buffer_end) { // handle the circular buffer
                    ptrTxControl->I2C_queue.get = ptrTxControl->I2C_queue.QUEbuffer;
                }
                ptrTxControl->I2C_queue.chars--;
            }
        }
    }
    #endif
    return ucByte;                                                       // prepare the byte to be returned
}
#endif

#if defined TEMP_LPI2C_TEST
    unsigned long ulRxLPI2Cpause = 0;
    unsigned long ulTxLPI2Cpause = 0;
    unsigned long ulChange = 0;
    static unsigned long ulChars = LPI2C_CHARACTERISTICS;
    #define LPI2C_CHARACTERISTICS_ ulChars
#else
    #define LPI2C_CHARACTERISTICS_ LPI2C_CHARACTERISTICS
#endif

