sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_LPI2C.h
static void ReceptionComplete(I2CQue *ptrTxControl, KINETIS_LPI2C_CONTROL *ptrLPI2C, int iChannel)
{
    I2CQue *ptrRxControl = I2C_rx_control[iChannel];
    ptrRxControl->msgs++;                                                // reception message available
    if (ptrRxControl->wake_task != 0) {                                  // wake up the receiver task if desired
        uTaskerStateChange(ptrRxControl->wake_task, UTASKER_ACTIVATE);   // wake up owner task
    }
    if (ptrTxControl->I2C_queue.chars != 0) {                            // reception has completed but we have further queued data
        fnLogEvent(iChannel, 'P', 0);
        fnTxI2C(ptrTxControl, iChannel);                                 // we have another message to send so we can send a repeated start condition
    }
    else {
        ptrLPI2C->LPI2C_MIER = LPI2C_MIER_SDIE;                          // disable reception interrupt and enable stop detect interrupt
        ptrLPI2C->LPI2C_MTDR = LPI2C_MTDR_CMD_STOP;                      // send stop condition
#if defined _WINDOWS
        ptrLPI2C->LPI2C_MSR |= LPI2C_MSR_SDF;                            // simulate the interrupt directly
        iInts |= (I2C_INT0 << iChannel);                                 // signal that an interrupt is to be generated
#endif
    }
}

static void fnLPI2C_Handler(KINETIS_LPI2C_CONTROL *ptrLPI2C, int iChannel) // general LPI2C interrupt handler
{
    I2CQue *ptrTxControl = I2C_tx_control[iChannel];
#if defined _WINDOWS
    int irq_id = (irq_LPI2C0_ID + iChannel);
    #if (LPI2C_AVAILABLE > 2) && defined irq_INTMUX0_0_ID
    if (iChannel == 2) {
        irq_id = (irq_INTMUX0_0_ID + INPUT_TO_INTMUX0_CHANNEL_2);
    }
    #endif
#endif
#if defined _iMX
    if (ptrLPI2C->LPI2C_MIER == 0) {                                     // ignore interrupts when there is no interrupt enabled
        fnLogEvent(iChannel, '?', ptrLPI2C->LPI2C_MSR);
        return;
    }
#endif

    if (((ptrLPI2C->LPI2C_MIER & ptrLPI2C->LPI2C_MSR) & LPI2C_MSR_SDF) != 0) { // stop condition has completed
        fnLogEvent(iChannel, 'S', ptrLPI2C->LPI2C_MSR);
        ptrLPI2C->LPI2C_MIER = 0;                                        // disable all interrupt sources
        WRITE_ONE_TO_CLEAR_INTERRUPT(ptrLPI2C->LPI2C_MSR, LPI2C_MSR_SDF, irq_id); // clear interrupt flag
        if ((ptrTxControl->ucState & RX_ACTIVE) != 0) {
          //I2CQue *ptrRxControl = I2C_rx_control[iChannel];
          //ptrRxControl->msgs++;
          //if (ptrRxControl->wake_task != 0) {                          // wake up the receiver task if desired
          //    uTaskerStateChange(ptrRxControl->wake_task, UTASKER_ACTIVATE); // wake up owner task
          //}
        }
        else {
            if (ptrTxControl->wake_task != 0) {
                uTaskerStateChange(ptrTxControl->wake_task, UTASKER_ACTIVATE); // wake up owner task since the transmission has terminated
            }
        }
        ptrTxControl->ucState &= ~(TX_WAIT | TX_ACTIVE | RX_ACTIVE);     // interface is idle
    #if defined TEMP_LPI2C_TEST
        if (ulChange != 0) {
            ptrLPI2C->LPI2C_MCR &= ~(LPI2C_MCR_MEN);
            if (ulChange & 0x01) {
                ptrLPI2C->LPI2C_MCFGR1 |= (LPI2C_MCFGR1_AUTOSTOP);
            }
            else if (ulChange & 0x02) {
                ptrLPI2C->LPI2C_MCFGR1 &= ~(LPI2C_MCFGR1_AUTOSTOP);
            }
            else if (ulChange & 0x04) {
                ulChars |= LPI2C_MCR_DOZEN;
                ptrLPI2C->LPI2C_MCR |= (LPI2C_MCR_DOZEN);
            }
            else if (ulChange & 0x08) {
                ulChars &= ~LPI2C_MCR_DOZEN;
                ptrLPI2C->LPI2C_MCR &= ~(LPI2C_MCR_DOZEN);
            }
            else if (ulChange & 0x10) {
                ulChars |= LPI2C_MCR_DBGEN;
                ptrLPI2C->LPI2C_MCR |= (LPI2C_MCR_DBGEN);
            }
            else if (ulChange & 0x20) {
                ulChars &= ~LPI2C_MCR_DBGEN;
                ptrLPI2C->LPI2C_MCR &= ~(LPI2C_MCR_DBGEN);
            }
            ulChange = 0;
            ptrLPI2C->LPI2C_MCR |= (LPI2C_MCR_MEN);
        }
    #endif
        if (ptrTxControl->I2C_queue.chars != 0) {                        // if there is further data waiting we can send it now
            fnLogEvent(iChannel, 'n', ptrTxControl->I2C_queue.chars);
            fnTxI2C(ptrTxControl, iChannel);                             // we have another message to send so we can send a repeated start condition
        }
        return;
    }

    if ((ptrTxControl->ucState & RX_ACTIVE) != 0) {                      // if the master is reading from a slave
        I2CQue *ptrRxControl = I2C_rx_control[iChannel];
        fnLogEvent(iChannel, 'R', ptrLPI2C->LPI2C_MSR);
        if ((ptrTxControl->ucState & TX_ACTIVE) != 0) {                  // the address transmission has completed
#if defined _iMX
            if (iChannel != iMX_LPI2C_3) {
#endif
            fnLogEvent(iChannel, 'A', ptrLPI2C->LPI2C_MRDR);
            (void)(ptrLPI2C->LPI2C_MRDR);                                // dummy read to clear address
            ptrLPI2C->LPI2C_MCR = (LPI2C_MCR_RRF | LPI2C_MCR_RTF | LPI2C_MCR_MEN | LPI2C_CHARACTERISTICS_); // ensure receive FIFO is reset
#if defined _iMX
            }
#endif
#if defined I2C_2_BYTE_LENGTH
            ptrLPI2C->LPI2C_MTDR = (LPI2C_MTDR_CMD_RX_DATA | (unsigned char)(ptrTxControl->usPresentLen - 1)); // command the read sequence
#else
            ptrLPI2C->LPI2C_MTDR = (LPI2C_MTDR_CMD_RX_DATA | (ptrTxControl->ucPresentLen - 1)); // command the read sequence
#endif
            ptrLPI2C->LPI2C_MIER = LPI2C_MIER_RDIE;                      // enable interrupt on reception available and disable transmission interrupt
            ptrTxControl->ucState = (RX_ACTIVE);                         // signal that the address has been sent and we are now receiving
#if defined _WINDOWS
            ptrLPI2C->LPI2C_MSR |= LPI2C_MSR_RDF;
            iInts |= (I2C_INT0 << iChannel);
#endif
        }
        else {                                                           // reception character available
#if defined _WINDOWS
            if ((ptrLPI2C->LPI2C_MDER & LPI2C_MDER_RDDE) == 0) {         // if not receiving with DMA
                if ((ptrLPI2C->LPI2C_MTDR & LPI2C_MTDR_DATA_MASK) != 0) {// this is a write-only register but the simulator uses it to count down the number of reception bytes that was set
                    ptrLPI2C->LPI2C_MTDR--;
                    ptrLPI2C->LPI2C_MSR |= LPI2C_MSR_RDF;
                    iInts |= (I2C_INT0 << iChannel);
                }
                else {
                    ptrLPI2C->LPI2C_MSR &= ~LPI2C_MSR_RDF;               // final reception was received so remove the reception ready flag
                }
                ptrLPI2C->LPI2C_MRDR = fnSimI2C_devices(iChannel, I2C_RX_DATA, (unsigned char)(ptrLPI2C->LPI2C_MRDR)); // {3}
            }
#endif
            *ptrRxControl->I2C_queue.put = (unsigned char)(ptrLPI2C->LPI2C_MRDR); // read the byte
            fnLogEvent(iChannel, 'r', *ptrRxControl->I2C_queue.put);
            ptrRxControl->I2C_queue.chars++;                             // and put it into the rx buffer
            if (++(ptrRxControl->I2C_queue.put) >= ptrRxControl->I2C_queue.buffer_end) { // handle circular input buffer
                ptrRxControl->I2C_queue.put = ptrRxControl->I2C_queue.QUEbuffer;
            }
#if defined I2C_2_BYTE_LENGTH
            if (--(ptrTxControl->usPresentLen) == 0)
#else
            if (--(ptrTxControl->ucPresentLen) == 0)
#endif
            {
                ReceptionComplete(ptrTxControl, ptrLPI2C, iChannel);
            }
        }
        return;
    }
    else
#if defined I2C_2_BYTE_LENGTH
    if (ptrTxControl->usPresentLen-- != 0)                               // TX_ACTIVE - send next byte if available
#else
    if (ptrTxControl->ucPresentLen-- != 0)                               // TX_ACTIVE - send next byte if available
#endif
    {
        fnLogEvent(iChannel, 'U', ptrLPI2C->LPI2C_MSR);
        fnLogEvent(iChannel, 'X', *ptrTxControl->I2C_queue.get);
        ptrLPI2C->LPI2C_MTDR = *ptrTxControl->I2C_queue.get++;           // send the next byte (note that the command byte is 0, meaning just send byte)
        if (ptrTxControl->I2C_queue.get >= ptrTxControl->I2C_queue.buffer_end) { // handle the circular transmit buffer
            ptrTxControl->I2C_queue.get = ptrTxControl->I2C_queue.QUEbuffer;
        }
        #if defined _WINDOWS
        ptrLPI2C->LPI2C_MSR |= LPI2C_MSR_TDF;                            // simulate the interrupt directly
        fnSimI2C_devices(iChannel, I2C_TX_DATA, (unsigned char)(ptrLPI2C->LPI2C_MTDR)); // {3}
        iInts |= (I2C_INT0 << iChannel);                                 // signal that an interrupt is to be generated
        #endif
    }
    else {                                                               // last byte in TX_ACTIVE
        if (ptrTxControl->I2C_queue.chars == 0) {                        // transmission complete
            ptrLPI2C->LPI2C_MIER = LPI2C_MIER_SDIE;                      // disable transmit interrupt and enable stop detect interrupt
            ptrLPI2C->LPI2C_MTDR = LPI2C_MTDR_CMD_STOP;                  // send stop condition
            fnLogEvent(iChannel, 'E', ptrLPI2C->LPI2C_MSR);
        #if defined _WINDOWS
            ptrLPI2C->LPI2C_MSR |= LPI2C_MSR_SDF;                        // simulate the interrupt directly
            iInts |= (I2C_INT0 << iChannel);                             // signal that an interrupt is to be generated
        #endif
        }
        else {
            fnLogEvent(iChannel, 'p', 0);
            fnTxI2C(ptrTxControl, iChannel);                             // we have another message to send so we can send a repeated start condition
        }
    }
}

static __interrupt void _I2C_Interrupt_0(void)                           // LPI2C0 interrupt
{
    fnLPI2C_Handler((KINETIS_LPI2C_CONTROL *)LPI2C0_BLOCK, 0);
}

    #if LPI2C_AVAILABLE > 1
static __interrupt void _I2C_Interrupt_1(void)                           // LPI2C1 interrupt
{
    fnLPI2C_Handler((KINETIS_LPI2C_CONTROL *)LPI2C1_BLOCK, 1);
}
    #endif

    #if LPI2C_AVAILABLE > 2
static __interrupt void _I2C_Interrupt_2(void)                           // LPI2C2 interrupt
{
    fnLPI2C_Handler((KINETIS_LPI2C_CONTROL *)LPI2C2_BLOCK, 2);
}
    #endif

    #if LPI2C_AVAILABLE > 3
static __interrupt void _I2C_Interrupt_3(void)                           // LPI2C3 interrupt
{
    fnLPI2C_Handler((KINETIS_LPI2C_CONTROL *)LPI2C3_BLOCK, 3);
}
    #endif


#if defined I2C_DMA_SUPPORT                                              // DMA support
static void fnStartLPI2C_TxDMA(I2CQue *ptI2CQue, QUEUE_HANDLE Channel)
{
    KINETIS_DMA_TDC *ptrDMA_TCD = (KINETIS_DMA_TDC *)eDMA_DESCRIPTORS;
    QUEUE_TRANSFER max_linear_data = (ptI2CQue->I2C_queue.buffer_end - ptI2CQue->I2C_queue.get);
    #if defined I2C_2_BYTE_LENGTH
    ptI2CQue->dma_length = ptI2CQue->usPresentLen;
    #else
    ptI2CQue->dma_length = ptI2CQue->ucPresentLen;
    #endif
    if (ptI2CQue->dma_length > max_linear_data) {
    #if defined I2C_2_BYTE_LENGTH
        ptI2CQue->dma_length = (unsigned short)max_linear_data;
    #else
        ptI2CQue->dma_length = (unsigned char)max_linear_data;
    #endif
    }
    ptrDMA_TCD += LPI2C_DMA_TX_CHANNEL[Channel];
    ptrDMA_TCD->DMA_TCD_BITER_ELINK = ptrDMA_TCD->DMA_TCD_CITER_ELINK = ptI2CQue->dma_length; // the number of service requests (the number of bytes to be transferred)
    ptrDMA_TCD->DMA_TCD_SADDR = (unsigned long)ptI2CQue->I2C_queue.get;  // source is I2C output buffer's present location
    #if defined SUPPORT_LOW_POWER
    PROTECTED_SET_VARIABLE(ulPeripheralNeedsClock, (I2C0_CLK_REQUIRED << Channel)); // mark that stop mode should be avoided until the I2C activity has completed
    #endif
    ATOMIC_PERIPHERAL_BIT_REF_SET(DMA_ERQ, LPI2C_DMA_TX_CHANNEL[Channel]); // enable request source in order to start DMA activity
    #if defined _WINDOWS                                                 // simulation
    iDMA |= (DMA_CONTROLLER_0 << LPI2C_DMA_TX_CHANNEL[Channel]);         // activate first DMA request
    #endif
}

static void fnStartLPI2C_RxDMA(I2CQue *ptI2CQue, QUEUE_HANDLE Channel)
{
    KINETIS_DMA_TDC *ptrDMA_TCD = (KINETIS_DMA_TDC *)eDMA_DESCRIPTORS;
    QUEQUE *ptrRxQueue = &I2C_rx_control[Channel]->I2C_queue;
    QUEUE_TRANSFER max_linear_data = (ptrRxQueue->buffer_end - ptrRxQueue->put);
    #if defined I2C_2_BYTE_LENGTH
    ptI2CQue->dma_length = ptI2CQue->usPresentLen;
    #else
    ptI2CQue->dma_length = ptI2CQue->ucPresentLen;
    #endif
    if (ptI2CQue->dma_length > max_linear_data) {
    #if defined I2C_2_BYTE_LENGTH
        ptI2CQue->dma_length = (unsigned short)max_linear_data;
    #else
        ptI2CQue->dma_length = (unsigned char)max_linear_data;
    #endif
    }
    ptrDMA_TCD += LPI2C_DMA_RX_CHANNEL[Channel];
    ptrDMA_TCD->DMA_TCD_BITER_ELINK = ptrDMA_TCD->DMA_TCD_CITER_ELINK = ptI2CQue->dma_length; // the number of service requests (the number of bytes to be transferred)
    ptrDMA_TCD->DMA_TCD_DADDR = (unsigned long)ptrRxQueue->put;          // destination is I2C input buffer's present location
    #if defined SUPPORT_LOW_POWER
    PROTECTED_SET_VARIABLE(ulPeripheralNeedsClock, (I2C0_CLK_REQUIRED << Channel)); // mark that stop mode should be avoided until the I2C activity has completed
    #endif
    ATOMIC_PERIPHERAL_BIT_REF_SET(DMA_ERQ, LPI2C_DMA_RX_CHANNEL[Channel]); // enable request source in order to start DMA activity
    #if defined _WINDOWS                                                 // simulation
    iDMA |= (DMA_CONTROLLER_0 << LPI2C_DMA_RX_CHANNEL[Channel]);         // activate first DMA request
    #endif
}

