sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_LPI2C.h
// Common DMA tx interrupt handler
//
static void _lpi2c_tx_dma_Interrupt(KINETIS_LPI2C_CONTROL *ptrLPI2C, int iChannel)
{
    I2CQue *ptrTxControl = I2C_tx_control[iChannel];
        #if defined _WINDOWS
    fnSimI2C_devices(iChannel, I2C_TX_DATA, (unsigned char)(ptrLPI2C->LPI2C_MTDR)); // {3}
        #endif
    #if defined I2C_2_BYTE_LENGTH
    ptrTxControl->usPresentLen -= ptrTxControl->dma_length;
    #else
    ptrTxControl->ucPresentLen -= ptrTxControl->dma_length;
    #endif
    ptrTxControl->I2C_queue.get += ptrTxControl->dma_length;
    if (ptrTxControl->I2C_queue.get >= ptrTxControl->I2C_queue.buffer_end) {
        ptrTxControl->I2C_queue.get -= ptrTxControl->I2C_queue.buf_length;
    }
    #if defined I2C_2_BYTE_LENGTH
    if (ptrTxControl->usPresentLen == 0)
    #else
    if (ptrTxControl->ucPresentLen == 0)
    #endif
    {                                                                    // if all data transmitted
        fnLPI2C_Handler(ptrLPI2C, iChannel);
    }
    else {                                                               // transmit remaining (after circular buffer wrap-around)
        fnStartLPI2C_TxDMA(ptrTxControl, iChannel);
        #if defined _WINDOWS
        fnSimI2C_devices(iChannel, I2C_TX_DATA, (unsigned char)(ptrLPI2C->LPI2C_MTDR)); // {3}
        #endif
    }    
}
static void _lpi2c0_tx_dma_Interrupt(void)
{
    _lpi2c_tx_dma_Interrupt((KINETIS_LPI2C_CONTROL *)LPI2C0_BLOCK, 0);
}

    #if LPI2C_AVAILABLE > 1
static void _lpi2c1_tx_dma_Interrupt(void)
{
    _lpi2c_tx_dma_Interrupt((KINETIS_LPI2C_CONTROL *)LPI2C1_BLOCK, 1);
}
    #endif
    #if LPI2C_AVAILABLE > 2
static void _lpi2c2_tx_dma_Interrupt(void)
{
    _lpi2c_tx_dma_Interrupt((KINETIS_LPI2C_CONTROL *)LPI2C2_BLOCK, 2);
}
    #endif

// Common DMA tx interrupt handler
//
static void _lpi2c_rx_dma_Interrupt(KINETIS_LPI2C_CONTROL *ptrLPI2C, int iChannel)
{
    I2CQue *ptrTxControl = I2C_tx_control[iChannel];
    I2CQue *ptrRxControl = I2C_rx_control[iChannel];
    #if defined I2C_2_BYTE_LENGTH
    ptrTxControl->usPresentLen -= ptrTxControl->dma_length;
    #else
    ptrTxControl->ucPresentLen -= ptrTxControl->dma_length;
    #endif
    ptrRxControl->I2C_queue.put += ptrRxControl->dma_length;
    if (ptrRxControl->I2C_queue.put >= ptrRxControl->I2C_queue.buffer_end) {
        ptrRxControl->I2C_queue.put -= ptrRxControl->I2C_queue.buf_length;
    }
    ptrRxControl->I2C_queue.chars += ptrTxControl->dma_length;
    #if defined I2C_2_BYTE_LENGTH
    if (ptrTxControl->usPresentLen == 0)
    #else
    if (ptrTxControl->ucPresentLen == 0)
    #endif
    {                                                                    // if all data received
        ReceptionComplete(ptrTxControl, ptrLPI2C, iChannel);
    }
    else {                                                               // receive remaining (after circular buffer wrap-around)
        fnStartLPI2C_RxDMA(ptrTxControl, iChannel);
    }
}


static void _lpi2c0_rx_dma_Interrupt(void)
{
    _lpi2c_rx_dma_Interrupt((KINETIS_LPI2C_CONTROL *)LPI2C0_BLOCK, 0);
}

    #if LPI2C_AVAILABLE > 1
static void _lpi2c1_rx_dma_Interrupt(void)
{
    _lpi2c_rx_dma_Interrupt((KINETIS_LPI2C_CONTROL *)LPI2C1_BLOCK, 1);
}
    #endif
    #if LPI2C_AVAILABLE > 2
static void _lpi2c2_rx_dma_Interrupt(void)
{
    _lpi2c_rx_dma_Interrupt((KINETIS_LPI2C_CONTROL *)LPI2C2_BLOCK, 2);
}
    #endif

static void (*_lpi2c_tx_dma_Interrupts[LPI2C_AVAILABLE])(void) = {
    _lpi2c0_tx_dma_Interrupt,
    #if LPI2C_AVAILABLE > 1
    _lpi2c1_tx_dma_Interrupt,
    #endif
    #if LPI2C_AVAILABLE > 2
    _lpi2c2_tx_dma_Interrupt,
    #endif
};

static void(*_lpi2c_rx_dma_Interrupts[LPI2C_AVAILABLE])(void) = {
    _lpi2c0_rx_dma_Interrupt,
    #if LPI2C_AVAILABLE > 1
    _lpi2c1_rx_dma_Interrupt,
    #endif
    #if LPI2C_AVAILABLE > 2
    _lpi2c2_rx_dma_Interrupt,
    #endif
};
#endif

/* =================================================================== */
/*                   I2C Transmission Initiation                       */
/* =================================================================== */


// Send a first byte to I2C bus
//
extern void fnTxI2C(I2CQue *ptI2CQue, QUEUE_HANDLE Channel)
{
    KINETIS_LPI2C_CONTROL *ptrLPI2C;
    unsigned char ucAddress;
    #if LPI2C_AVAILABLE > 1
    if (Channel == 1) {
        ptrLPI2C = (KINETIS_LPI2C_CONTROL *)LPI2C1_BLOCK;
    }
        #if LPI2C_AVAILABLE > 2
    else if (Channel == 2) {
        ptrLPI2C = (KINETIS_LPI2C_CONTROL *)LPI2C2_BLOCK;
    }
        #endif
        #if LPI2C_AVAILABLE > 3
    else if (Channel == 3) {
        ptrLPI2C = (KINETIS_LPI2C_CONTROL *)LPI2C3_BLOCK;
    }
        #endif
    else {
        ptrLPI2C = (KINETIS_LPI2C_CONTROL *)LPI2C0_BLOCK;
    }
    #else
    ptrLPI2C = (KINETIS_LPI2C_CONTROL *)LPI2C0_BLOCK;
    #endif
    #if defined I2C_2_BYTE_LENGTH
    ptI2CQue->usPresentLen = *ptI2CQue->I2C_queue.get++;                 // get the length of this transaction (MSB)
    ptI2CQue->usPresentLen <<= 8;
    if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {     // handle circular buffer
        ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer;
    }
    ptI2CQue->usPresentLen |= *ptI2CQue->I2C_queue.get++;                // length LSB
    #else
    ptI2CQue->ucPresentLen = *ptI2CQue->I2C_queue.get++;                 // get the length of this transaction
    #endif
    if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {     // handle circular buffer
        ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer;
    }

    if ((ptI2CQue->ucState & (TX_ACTIVE | RX_ACTIVE)) != 0) {            // restart since we are hanging a second telegram on to previous one
        fnLogEvent(Channel, '*', ptrLPI2C->LPI2C_MSR);
    }
    else {                                                               // address to be sent on an idle bus
        if ((ucCheckTxI2C & (1 << Channel)) == 0) {                      // on first use we check that the bus is not held in a busy state (can happen when a reset took place during an acknowledge period and the slave is holding the bus)
            ucCheckTxI2C |= (1 << Channel);                              // checked only once
            uEnable_Interrupt();
                fnConfigLPI2C_pins(Channel, 1);                          // check and configure pins for LPI2C use
            uDisable_Interrupt();
        }
        fnLogEvent(Channel, 'B', ptrLPI2C->LPI2C_MSR);
        _WAIT_REGISTER_TRUE(ptrLPI2C->LPI2C_MSR, LPI2C_MSR_BBF);         // wait until the stop has actually been sent to avoid a further transmission being started in the mean time
        fnLogEvent(Channel, 'b', ptrLPI2C->LPI2C_MSR);
    }
    // Generate a start condition/repeated start and send the address
    //
    WRITE_ONE_TO_CLEAR(ptrLPI2C->LPI2C_MSR, (LPI2C_MSR_EPF | LPI2C_MSR_SDF | LPI2C_MSR_NDF | LPI2C_MSR_ALF | LPI2C_MSR_FEF | LPI2C_MSR_PLTF | LPI2C_MSR_DMF)); // {2} clear flags to ensure that the address can be sent if following a non-acked transfer

    ucAddress = *ptI2CQue->I2C_queue.get++;                              // get the slave address
    ptrLPI2C->LPI2C_MTDR = (LPI2C_MTDR_CMD_START_DATA | ucAddress);      // generate a start or repeated start and send the slave address (this includes the rd/wr bit)
    #if defined TEMP_LPI2C_TEST
    if ((ulRxLPI2Cpause != 0) && ((ucAddress & 0x01) != 0)) {
        fnDelayLoop(ulRxLPI2Cpause);
    }
    else if ((ulTxLPI2Cpause != 0) && ((ucAddress & 0x01) == 0)) {
        fnDelayLoop(ulTxLPI2Cpause);
    }
    #endif
    fnLogEvent(Channel, '?', ucAddress);
    if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {     // handle circular buffer
        ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer;
    }
    if ((ucAddress & 0x01) != 0) {                                       // reading from the slave
        I2C_tx_control[Channel]->ucState |= (RX_ACTIVE | TX_ACTIVE);
    #if defined I2C_2_BYTE_LENGTH
        ptI2CQue->I2C_queue.chars -= 4;
    #else
        ptI2CQue->I2C_queue.chars -= 3;
    #endif
        fnLogEvent(Channel, 'g', (unsigned char)(ptI2CQue->I2C_queue.chars));
        I2C_rx_control[Channel]->wake_task = *ptI2CQue->I2C_queue.get++; // enter task to be woken when reception has completed
        if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {
            ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer;     // handle circular buffer
        }
    #if defined I2C_DMA_SUPPORT
        if ((ptrLPI2C->LPI2C_MDER & LPI2C_MDER_RDDE) != 0) {             // if using DMA for reception
            ptrLPI2C->LPI2C_MIER = 0;                                    // disable interrupts
            fnStartLPI2C_RxDMA(ptI2CQue, Channel);
        #if defined _WINDOWS
            fnSimI2C_devices(Channel, I2C_ADDRESS, (unsigned char)(ptrLPI2C->LPI2C_MTDR)); // {3}
        #endif
            ptrLPI2C->LPI2C_MTDR = (LPI2C_MTDR_CMD_RX_DATA | (ptI2CQue->dma_length - 1)); // command the read sequence
            return;
        }
    #endif
    }
    else {
        I2C_tx_control[Channel]->ucState &= ~(RX_ACTIVE);
        I2C_tx_control[Channel]->ucState |= (TX_ACTIVE);                 // writing to the slave
    #if defined I2C_2_BYTE_LENGTH
        ptI2CQue->I2C_queue.chars -= (ptI2CQue->usPresentLen + 1);       // the remaining queue content after this transaction completes
    #else
        ptI2CQue->I2C_queue.chars -= (ptI2CQue->ucPresentLen + 1);       // the remaining queue content after this transaction completes
    #endif
        fnLogEvent(Channel, 'h', (unsigned char)(ptI2CQue->I2C_queue.chars));
    #if defined I2C_DMA_SUPPORT
        if ((ptrLPI2C->LPI2C_MDER & LPI2C_MDER_TDDE) != 0) {             // if using DMA for transmission
            fnStartLPI2C_TxDMA(ptI2CQue, Channel);
        #if defined _WINDOWS
            fnSimI2C_devices(Channel, I2C_ADDRESS, (unsigned char)(ptrLPI2C->LPI2C_MTDR)); // {3}
        #endif
            return;
        }
    #endif
    }
    ptrLPI2C->LPI2C_MIER = (LPI2C_MIER_TDIE);                            // enable interrupt on transmission completion
    fnLogEvent(Channel, 'T', ptrLPI2C->LPI2C_MSR);
    #if defined _WINDOWS
    ptrLPI2C->LPI2C_MSR |= LPI2C_MSR_TDF;                                // simulate the interrupt directly
    fnSimI2C_devices(Channel, I2C_ADDRESS, (unsigned char)(ptrLPI2C->LPI2C_MTDR)); // {3}
    iInts |= (I2C_INT0 << Channel);                                      // signal that an interrupt is to be generated
    #endif
}



/* =================================================================== */
/*                         I2C Configuration                           */
/* =================================================================== */

