sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_LPI2C.h
// Initially the I2C pins were configured as inputs to allow an I2C bus lockup state to be detected
// - this routine checks for this state and generates clocks if needed to recover from it before setting I2C pin functions
//
static void fnConfigLPI2C_pins(QUEUE_HANDLE Channel, int iMaster)        // {2}
{
    if (Channel == 0)  {                                                 // LPI2C0
    #if defined _iMX                                                     // LPI2C1 for i.MX RT
        #if defined iMX_RT105X || defined iMX_RT106X
        if (iMaster != 0) {
            while (_READ_PORT_MASK(1, PIN_GPIO_AD_B1_01_GPIO1_IO17) == 0) { // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, PIN_GPIO_AD_B1_00_GPIO1_IO16, 0, (PORT_ODE | PORT_DSE_5 | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(1, PIN_GPIO_AD_B1_00_GPIO1_IO16, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        IOMUXC_LPI2C1_SDA_SELECT_INPUT = IOMUXC_LPI2C1_SDA_SELECT_INPUT_GPIO_AD_B1_01_ALT3;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B1_01, LPI2C1_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SDA on GPIO1-17 - alt function 3 [iMX LPI2C count 1..4]
        IOMUXC_LPI2C1_SCL_SELECT_INPUT = IOMUXC_LPI2C1_SCL_SELECT_INPUT_GPIO_AD_B1_00_ALT3;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B1_00, LPI2C1_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SCL on GPIO1-16 - alt function 3 [iMX LPI2C count 1..4]
        #elif defined iMX_RT1011
        if (iMaster != 0) {
            while (_READ_PORT_MASK(1, PORT1_BIT27) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, PORT1_BIT28, 0, (PORT_ODE | PORT_DSE_5 | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(1, PORT1_BIT28, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        IOMUXC_LPI2C1_SDA_SELECT_INPUT = IOMUXC_LPI2C1_SDA_SELECT_INPUT_GPIO_AD_13_ALT0;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_13, LPI2C1_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SDA on GPIO1-27 - alt function 0 [iMX LPI2C count 1..4]
        IOMUXC_LPI2C1_SCL_SELECT_INPUT = IOMUXC_LPI2C1_SCL_SELECT_INPUT_GPIO_AD_14_ALT0;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_14, LPI2C1_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SCL on GPIO1-28 - alt function 0 [iMX LPI2C count 1..4]        
        #else
            #if defined iMX_RT102X && defined LPI2C1_ON_EMC
        if (iMaster != 0) {
            while (_READ_PORT_MASK(2, PIN_GPIO_EMC_03_GPIO2_IO03) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(2, PIN_GPIO_EMC_02_GPIO2_IO02, 0, (PORT_ODE | PORT_DSE_5 | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(2, PIN_GPIO_EMC_02_GPIO2_IO02, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        IOMUXC_LPI2C1_SDA_SELECT_INPUT = IOMUXC_LPI2C1_SDA_SELECT_INPUT_GPIO_EMC_03_ALT6;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_EMC_03, LPI2C1_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SDA on GPIO2-03 - alt function 0 [iMX LPI2C count 1..4]
        IOMUXC_LPI2C1_SCL_SELECT_INPUT = IOMUXC_LPI2C1_SCL_SELECT_INPUT_GPIO_EMC_02_ALT6;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_EMC_02, LPI2C1_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SCL on GPIO2-02 - alt function 0 [iMX LPI2C count 1..4]
            #else
        if (iMaster != 0) {
            while (_READ_PORT_MASK(1, PIN_GPIO_AD_B1_15_GPIO1_IO31) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, PIN_GPIO_AD_B1_14_GPIO1_IO30, 0, (PORT_ODE | PORT_DSE_5 | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(1, PIN_GPIO_AD_B1_14_GPIO1_IO30, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
                #if defined IOMUXC_LPI2C1_SDA_SELECT_INPUT
        IOMUXC_LPI2C1_SDA_SELECT_INPUT = IOMUXC_LPI2C1_SDA_SELECT_INPUT_GPIO_AD_B1_15_ALT0;
                #endif
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B1_15, LPI2C1_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SDA on GPIO1-31 - alt function 0 [iMX LPI2C count 1..4]
                #if defined IOMUXC_LPI2C1_SCL_SELECT_INPUT
        IOMUXC_LPI2C1_SCL_SELECT_INPUT = IOMUXC_LPI2C1_SCL_SELECT_INPUT_GPIO_AD_B1_14_ALT0;
                #endif
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B1_14, LPI2C1_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SCL on GPIO1-30 - alt function 0 [iMX LPI2C count 1..4]
            #endif
        #endif
    #elif (defined KINETIS_KE15 || defined KINETIS_KE15 || defined KINETIS_KE16 || defined KINETIS_KE18) && defined I2C0_ON_B
        if (iMaster != 0) {
            while (_READ_PORT_MASK(B, PORTB_BIT6) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(B, PORTB_BIT7, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_LOW(B, PORTB_BIT7, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(B, 6, (PB_6_I2C0_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SDA on PB6 (alt. function 2)
        _CONFIG_PERIPHERAL(B, 7, (PB_7_I2C0_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SCL on PB7 (alt. function 2)
    #elif (defined KINETIS_KE15 || defined KINETIS_KE15 || defined KINETIS_KE16 || defined KINETIS_KE18)
        if (iMaster != 0) {
            while (_READ_PORT_MASK(A, PORTA_BIT2) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(A, PORTA_BIT3, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_LOW(A, PORTA_BIT3, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(A, 2, (PA_2_I2C0_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SDA on PA2 (alt. function 3)
        _CONFIG_PERIPHERAL(A, 3, (PA_3_I2C0_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SCL on PA3 (alt. function 3)
    #elif defined I2C0_E_LOW
        if (iMaster != 0) {
            while (_READ_PORT_MASK(E, PORTE_BIT18) == 0) {               // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_HIGH(E, PORTE_BIT19, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_HIGH(E, PORTE_BIT19, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(E, 18, (PE_18_I2C0_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SDA on PE18 (alt. function 4)
        _CONFIG_PERIPHERAL(E, 19, (PE_19_I2C0_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SCL on PE19 (alt. function 4)
    #elif defined I2C0_B_LOW
        if (iMaster != 0) {
            while (_READ_PORT_MASK(B, PORTB_BIT1) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(B, PORTB_BIT0, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT__FAST_LOW(B, PORTB_BIT0, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(B, 1, (PB_1_I2C0_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SDA on PB1 (alt. function 2)
        _CONFIG_PERIPHERAL(B, 0, (PB_0_I2C0_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SCL on PB0 (alt. function 2)
    #elif defined I2C0_B_HIGH
        if (iMaster != 0) {
            while (_READ_PORT_MASK(B, PORTB_BIT3) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(B, PORTB_BIT2, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_LOW(B, PORTB_BIT2, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(B, 3, (PB_3_I2C0_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SDA on PB3 (alt. function 2)
        _CONFIG_PERIPHERAL(B, 2, (PB_2_I2C0_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SCL on PB2 (alt. function 2)
    #elif defined I2C0_ON_C
        if (iMaster != 0) {
            while (_READ_PORT_MASK(C, PORTC_BIT9) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(C, PORTC_BIT8, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_LOW(C, PORTC_BIT8, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(C, 9, (PC_9_I2C0_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SDA on PC9 (alt. function 2)
        _CONFIG_PERIPHERAL(C, 8, (PC_8_I2C0_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SCL on PC8 (alt. function 2)
    #elif defined I2C0_D_LOW
        if (iMaster != 0) {
            while (_READ_PORT_MASK(D, PORTD_BIT9) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE__FAST_LOW(D, PORTD_BIT8, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT__FAST_LOW(D, PORTD_BIT8, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(D, 9, (PD_9_I2C0_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SDA on PD9 (alt. function 2)
        _CONFIG_PERIPHERAL(D, 8, (PD_8_I2C0_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SCL on PD8 (alt. function 2)
    #elif defined I2C0_D_HIGH
        if (iMaster != 0) {
            while (_READ_PORT_MASK(D, PORTD_BIT11) == 0) {               // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE__FAST_LOW(D, PORTD_BIT10, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT__FAST_LOW(D, PORTD_BIT10, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(D, 11, (PD_11_I2C0_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SDA on PD11 (alt. function 3)
        _CONFIG_PERIPHERAL(D, 10, (PD_10_I2C0_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SCL on PD10 (alt. function 3)
    #else
        if (iMaster != 0) {
            while (_READ_PORT_MASK(E, PORTE_BIT25) == 0) {               // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_HIGH(E, PORTE_BIT24, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_HIGH(E, PORTE_BIT24, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(E, 25, (PE_25_I2C0_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SDA on PE25 (alt. function 5)
        _CONFIG_PERIPHERAL(E, 24, (PE_24_I2C0_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C0_SCL on PE24 (alt. function 5)
    #endif
    }
    #if LPI2C_AVAILABLE > 1
    else if (Channel == 1)  {                                            // LPI2C1
        #if defined _iMX                                                 // LPI2C2 for i.MX RT
            #if defined iMX_RT105X || defined iMX_RT106X
        if (iMaster != 0) {
            while (_READ_PORT_MASK(2, PIN_GPIO_B0_05_GPIO2_IO05) == 0) {  // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(2, PIN_GPIO_B0_04_GPIO2_IO04, 0, (PORT_ODE | PORT_DSE_5 | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(2, PIN_GPIO_B0_04_GPIO2_IO04, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        IOMUXC_LPI2C2_SDA_SELECT_INPUT = IOMUXC_LPI2C2_SDA_SELECT_INPUT_GPIO_B0_05_ALT2;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_B0_05, LPI2C2_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SDA on GPIO2-05 - alt function 2 [iMX LPI2C count 1..4]
        IOMUXC_LPI2C2_SCL_SELECT_INPUT = IOMUXC_LPI2C2_SCL_SELECT_INPUT_GPIO_B0_04_ALT2;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_B0_04, LPI2C2_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SCL on GPIO2-04 - alt function 2 [iMX LPI2C count 1..4]
            #elif defined iMX_RT1011
        if (iMaster != 0) {
            while (_READ_PORT_MASK(1, PIN_GPIO_AD_07_GPIO1_IO21) == 0) { // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, PIN_GPIO_AD_08_GPIO1_IO22, 0, (PORT_ODE | PORT_DSE_5 | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(1, PIN_GPIO_AD_08_GPIO1_IO22, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        IOMUXC_LPI2C2_SDA_SELECT_INPUT = IOMUXC_LPI2C2_SDA_SELECT_INPUT_GPIO_AD_07_ALT0;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_07, LPI2C2_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SDA on GPIO1-21 - alt function 0 [iMX LPI2C count 1..4]
        IOMUXC_LPI2C2_SCL_SELECT_INPUT = IOMUXC_LPI2C2_SCL_SELECT_INPUT_GPIO_AD_08_ALT0;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_08, LPI2C2_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SCL on GPIO1-22 - alt function 0 [iMX LPI2C count 1..4]
            #else
                #if defined iMX_RT102X && defined LPI2C2_ON_EMC
        if (iMaster != 0) {
            while (_READ_PORT_MASK(2, PIN_GPIO_EMC_18_GPIO2_IO18) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(2, PIN_GPIO_EMC_19_GPIO2_IO19, 0, (PORT_ODE | PORT_DSE_5 | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(2, PIN_GPIO_EMC_19_GPIO2_IO19, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        IOMUXC_LPI2C2_SDA_SELECT_INPUT = IOMUXC_LPI2C2_SDA_SELECT_INPUT_GPIO_EMC_18_ALT2;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_EMC_18, LPI2C2_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SDA on GPIO2-18 - alt function 2 [iMX LPI2C count 1..4]
        IOMUXC_LPI2C2_SCL_SELECT_INPUT = IOMUXC_LPI2C2_SCL_SELECT_INPUT_GPIO_EMC_19_ALT2;
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_EMC_19, LPI2C2_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SCL on GPIO2-19 - alt function 2 [iMX LPI2C count 1..4]
                #else
        if (iMaster != 0) {
            while (_READ_PORT_MASK(1, PIN_GPIO_AD_B1_09_GPIO1_IO25) == 0) { // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, PIN_GPIO_AD_B1_08_GPIO1_IO24, 0, (PORT_ODE | PORT_DSE_5 | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(1, PIN_GPIO_AD_B1_08_GPIO1_IO24, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
                    #if defined IOMUXC_LPI2C2_SDA_SELECT_INPUT
        IOMUXC_LPI2C2_SDA_SELECT_INPUT = IOMUXC_LPI2C2_SDA_SELECT_INPUT_GPIO_AD_B1_09_ALT0;
                    #endif
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B1_09, LPI2C2_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SDA on GPIO1-25 - alt function 0 [iMX LPI2C count 1..4]
                    #if defined IOMUXC_LPI2C2_SCL_SELECT_INPUT
        IOMUXC_LPI2C2_SCL_SELECT_INPUT = IOMUXC_LPI2C2_SCL_SELECT_INPUT_GPIO_AD_B1_08_ALT0;
                    #endif
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B1_08, LPI2C2_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SCL on GPIO1-24 - alt function 0 [iMX LPI2C count 1..4]
                #endif
            #endif
        #elif defined KINETIS_KE15 && defined I2C1_ON_D                  // initially configure as inputs with pull-up
        if (iMaster != 0) {
            while (_READ_PORT_MASK(D, PORTD_BIT8) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE__FAST_LOW(D, PORTD_BIT9, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT__FAST_LOW(D, PORTD_BIT9, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL_LOOPBACK(D, 8, (PD_8_I2C1_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SDA on PD8 (alt. function 2)
        _CONFIG_PERIPHERAL_LOOPBACK(D, 9, (PD_9_I2C1_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SCL on PD9 (alt. function 2)
        #elif defined KINETIS_KE15
        if (iMaster != 0) {
            while (_READ_PORT_MASK(E, PORTE_BIT0) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(E, PORTE_BIT1, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_LOW(E, PORTE_BIT1, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(E, 0, (PE_0_I2C1_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SDA on PE0 (alt. function 4)
        _CONFIG_PERIPHERAL(E, 1, (PE_1_I2C1_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SCL on PE1 (alt. function 4)
        #elif defined I2C1_ON_A
        if (iMaster != 0) {
            while (_READ_PORT_MASK(A, PORTA_BIT4) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(A, PORTA_BIT3, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_LOW(A, PORTA_BIT3, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(A, 4, (PA_4_I2C1_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SDA on PA4 (alt. function 3)
        _CONFIG_PERIPHERAL(A, 3, (PA_3_I2C1_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SCL on PA3 (alt. function 3)
        #elif defined I2C1_C_LOW
        if (iMaster != 0) {
            while (_READ_PORT_MASK(C, PORTC_BIT2) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(C, PORTC_BIT1, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_LOW(C, PORTC_BIT1, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(C, 2, (PC_2_I2C1_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SDA on PC2 (alt. function 2)
        _CONFIG_PERIPHERAL(C, 1, (PC_1_I2C1_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SCL on PC1 (alt. function 2)
        #elif defined I2C1_C_HIGH
        if (iMaster != 0) {
            while (_READ_PORT_MASK(C, PORTC_BIT11) == 0) {               // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(C, PORTC_BIT10, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_LOW(C, PORTC_BIT10, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(C, 11, (PC_11_I2C1_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SDA on PC9 (alt. function 2)
        _CONFIG_PERIPHERAL(C, 10, (PC_10_I2C1_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SCL on PC8 (alt. function 2)
        #else
        if (iMaster != 0) {
            while (_READ_PORT_MASK(E, PORTE_BIT0) == 0) {                // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(E, PORTE_BIT1, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_LOW(E, PORTE_BIT1, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(E, 0, (PE_0_I2C1_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SDA on PE0 (alt. function 6)
        _CONFIG_PERIPHERAL(E, 1, (PE_1_I2C1_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C1_SCL on PE1 (alt. function 6)
        #endif
    }
    #endif
    #if LPI2C_AVAILABLE > 2
    else if (Channel == 2) {                                             // LPI2C2
        #if defined _iMX                                                 // LPI2C3 for i.MX RT
            #if defined iMX_RT105X || defined iMX_RT106X
                #if defined LPI2C3_ON_EMC
        if (iMaster != 0) {
            while (_READ_PORT_MASK(4, PIN_GPIO_EMC_21_GPIO4_IO21) == 0) { // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(4, PIN_GPIO_EMC_22_GPIO4_IO22, 0, (PORT_ODE | PORT_DSE_MID | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(4, PIN_GPIO_EMC_22_GPIO4_IO22, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        IOMUXC_LPI2C3_SDA_SELECT_INPUT = IOMUXC_LPI2C3_SDA_SELECT_INPUT_GPIO_EMC_21_ALT2; // special case to select the pad involved in daisy chain
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_EMC_21, LPI2C3_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C3_SDA on GPIO4-21 - alt function 2 [iMX LPI2C count 1..4]
        IOMUXC_LPI2C3_SCL_SELECT_INPUT = IOMUXC_LPI2C3_SCL_SELECT_INPUT_GPIO_EMC_22_ALT2; // special case to select the pad involved in daisy chain
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_EMC_22, LPI2C3_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C3_SCL on GPIO4-22 - alt function 2 [iMX LPI2C count 1..4]        
                #elif defined LPI2C3_ON_SD
        if (iMaster != 0) {
            while (_READ_PORT_MASK(3, PIN_GPIO_SD_B0_01_GPIO3_IO13) == 0) { // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(3, PIN_GPIO_SD_B0_00_GPIO3_IO12, 0, (PORT_ODE | PORT_DSE_MID | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(3, PIN_GPIO_SD_B0_00_GPIO3_IO12, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        IOMUXC_LPI2C3_SDA_SELECT_INPUT = IOMUXC_LPI2C3_SDA_SELECT_INPUT_GPIO_SD_B0_01_ALT2; // special case to select the pad involved in daisy chain
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_SD_B0_01, LPI2C3_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C3_SDA on GPIO3-13 - alt function 2 [iMX LPI2C count 1..4]
        IOMUXC_LPI2C3_SCL_SELECT_INPUT = IOMUXC_LPI2C3_SCL_SELECT_INPUT_GPIO_SD_B0_00_ALT2; // special case to select the pad involved in daisy chain
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_SD_B0_00, LPI2C3_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C3_SCL on GPIO3-12 - alt function 2 [iMX LPI2C count 1..4]        

