sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_LPI2C.h
                #else
        if (iMaster != 0) {
            while (_READ_PORT_MASK(1, PIN_GPIO_AD_B1_06_GPIO1_IO22) == 0) { // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, PIN_GPIO_AD_B1_07_GPIO1_IO23, 0, (PORT_ODE | PORT_DSE_MID | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(1, PIN_GPIO_AD_B1_07_GPIO1_IO23, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        IOMUXC_LPI2C3_SDA_SELECT_INPUT = IOMUXC_LPI2C3_SDA_SELECT_INPUT_GPIO_AD_B1_06_ALT1; // special case to select the pad involved in daisy chain
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B1_06, LPI2C3_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C3_SDA on GPIO1-22 - alt function 1 [iMX LPI2C count 1..4]
        IOMUXC_LPI2C3_SCL_SELECT_INPUT = IOMUXC_LPI2C3_SCL_SELECT_INPUT_GPIO_AD_B1_07_ALT1; // special case to select the pad involved in daisy chain
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B1_07, LPI2C3_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C3_SCL on GPIO1-23 - alt function 1 [iMX LPI2C count 1..4]        
                #endif
            #else
                #if defined iMX_RT102X && defined LPI2C3_ON_SD
        if (iMaster != 0) {
            while (_READ_PORT_MASK(3, PIN_GPIO_SD_B0_01_GPIO3_IO14) == 0) { // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(3, PIN_GPIO_SD_B0_00_GPIO3_IO13, 0, (PORT_ODE | PORT_DSE_MID | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(3, PIN_GPIO_SD_B0_00_GPIO3_IO13, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        IOMUXC_LPI2C3_SDA_SELECT_INPUT = IOMUXC_LPI2C3_SDA_SELECT_INPUT_GPIO_SD_B0_01_ALT4; // special case to select the pad involved in daisy chain
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_SD_B0_01, LPI2C3_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C3_SDA on GPIO3-14 - alt function 2/4 [iMX LPI2C count 1..4]
        IOMUXC_LPI2C3_SCL_SELECT_INPUT = IOMUXC_LPI2C3_SCL_SELECT_INPUT_GPIO_SD_B0_00_ALT4; // special case to select the pad involved in daisy chain
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_SD_B0_00, LPI2C3_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C3_SCL on GPIO3-13 - alt function 2/ [iMX LPI2C count 1..4]
                #else
        if (iMaster != 0) {
            while (_READ_PORT_MASK(1, PIN_GPIO_AD_B0_09_GPIO1_IO09) == 0) { // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, PIN_GPIO_AD_B0_08_GPIO1_IO08, 0, (PORT_ODE | PORT_DSE_MID | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(1, PIN_GPIO_AD_B0_08_GPIO1_IO08, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
                    #if defined IOMUXC_LPI2C3_SDA_SELECT_INPUT
        IOMUXC_LPI2C3_SDA_SELECT_INPUT = IOMUXC_LPI2C3_SDA_SELECT_INPUT_GPIO_AD_B0_08_ALT1; // special case to select the pad involved in daisy chain
                    #endif
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B0_09, LPI2C3_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C3_SDA on GPIO1-09 - alt function 1 [iMX LPI2C count 1..4]
                    #if defined IOMUXC_LPI2C3_SCL_SELECT_INPUT
        IOMUXC_LPI2C3_SCL_SELECT_INPUT = IOMUXC_LPI2C3_SCL_SELECT_INPUT_GPIO_AD_B0_09_ALT1; // special case to select the pad involved in daisy chain
                    #endif
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B0_08, LPI2C3_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C3_SCL on GPIO1-08 - alt function 1 [iMX LPI2C count 1..4]
                #endif
            #endif
        #elif defined I2C2_A_HIGH
        if (iMaster != 0) {
            while (_READ_PORT_MASK(A, PORTA_BIT13) == 0) {               // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(A, PORTA_BIT14, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_LOW(A, PORTA_BIT14, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL_LOOPBACK(A, 13, (PA_13_I2C2_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SDA on PA13 (alt. function 5)
        _CONFIG_PERIPHERAL_LOOPBACK(A, 14, (PA_14_I2C2_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SCL on PA14 (alt. function 5)
        #else
        if (iMaster != 0) {
            while (_READ_PORT_MASK(A, PORTA_BIT11) == 0) {               // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(A, PORTA_BIT12, 0, (PORT_ODE | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT_FAST_LOW(A, PORTA_BIT12, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        _CONFIG_PERIPHERAL(A, 11, (PA_11_I2C2_SDA | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SDA on PA11 (alt. function 5)
        _CONFIG_PERIPHERAL(A, 12, (PA_12_I2C2_SCL | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C2_SCL on PA12 (alt. function 5)
        #endif
    }
    #endif
    #if LPI2C_AVAILABLE > 3
    else if (Channel == 3) {                                             // LPI2C3
        #if defined _iMX                                                 // LPI2C4 for i.MX RT
        if (iMaster != 0) {
            #if defined iMX_RT105X || defined iMX_RT106X
                #if defined I2C4_ON_4
            while (_READ_PORT_MASK(4, PORT4_BIT11) == 0) {               // if the SDA line is low we clock the SCL line to free it
                CONFIG_DRIVE_PORT_OUTPUT_VALUE(4, PORT4_BIT12, 0, (PORT_ODE | PORT_DSE_MID | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                CONFIG_PORT_INPUT(4, PORT4_BIT12, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
                #else
            while (_READ_PORT_MASK(1, PORT1_BIT13) == 0) {               // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, PORT1_BIT12, 0, (PORT_ODE | PORT_DSE_MID | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(1, PORT1_BIT12, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
                #endif
        }
                #if defined I2C4_ON_4
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_EMC_11, LPI2C4_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C4_SDA on GPIO4-11 - alt function 2 [iMX LPI2C count 1..4]
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_EMC_12, LPI2C4_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C4_SCL on GPIO4-12 - alt function 2 [iMX LPI2C count 1..4]
                #else
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B0_13, LPI2C4_SDA, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C4_SDA on GPIO1-13 - alt function 0 [iMX LPI2C count 1..4]
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_AD_B0_12, LPI2C4_SCL, (PORT_DSE_MID | PORT_ODE | PORT_PS_UP_ENABLE)); // LPI2C4_SCL on GPIO1-12 - alt function 0 [iMX LPI2C count 1..4]        
                #endif
            #else
                #if defined iMX_RT102X && defined LPI2C3_ON_SD
            while (_READ_PORT_MASK(3, PIN_GPIO_SD_B1_03_GPIO3_IO23) == 0) { // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(3, PIN_GPIO_SD_B1_02_GPIO3_IO22, 0, (PORT_ODE | PORT_DSE_MID | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(3, PIN_GPIO_SD_B1_02_GPIO3_IO22, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
        IOMUXC_LPI2C4_SDA_SELECT_INPUT = IOMUXC_LPI2C4_SDA_SELECT_INPUT_GPIO_SD_B1_03_ALT3; // special case to select the pad involved in daisy chain
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_SD_B1_03, LPI2C4_SDA, (IOMUXC_SW_PAD_CTL_PAD_DSE_6 | IOMUXC_SW_PAD_CTL_PAD_SPEED_MEDIUM | PORT_ODE | IOMUXC_SW_PAD_CTL_PAD_PUS_22k_UP | IOMUXC_SW_PAD_CTL_PAD_PKE)); // LPI2C4_SDA on GPIO3-23 - alt function 3 [iMX LPI2C count 1..4]
        IOMUXC_LPI2C4_SCL_SELECT_INPUT = IOMUXC_LPI2C4_SCL_SELECT_INPUT_GPIO_SD_B1_02_ALT3; // special case to select the pad involved in daisy chain
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_SD_B1_02, LPI2C4_SCL, (IOMUXC_SW_PAD_CTL_PAD_DSE_6 | IOMUXC_SW_PAD_CTL_PAD_SPEED_MEDIUM | PORT_ODE | IOMUXC_SW_PAD_CTL_PAD_PUS_22k_UP | IOMUXC_SW_PAD_CTL_PAD_PKE)); // LPI2C4_SCL on GPIO3-22 - alt function 3 [iMX LPI2C count 1..4]        
                #else
            while (_READ_PORT_MASK(2, GPIO_EMC_10_GPIO2_IO10) == 0) { // if the SDA line is low we clock the SCL line to free it
                _CONFIG_DRIVE_PORT_OUTPUT_VALUE(2, GPIO_EMC_11_GPIO2_IO11, 0, (PORT_ODE | PORT_DSE_MID | PORT_PS_UP_ENABLE)); // set output '0'
                fnDelayLoop(10);
                _CONFIG_PORT_INPUT(2, GPIO_EMC_11_GPIO2_IO11, (PORT_ODE | PORT_PS_UP_ENABLE));
                fnDelayLoop(10);
            }
        }
                    #if defined IOMUXC_LPI2C4_SDA_SELECT_INPUT
        IOMUXC_LPI2C4_SDA_SELECT_INPUT = IOMUXC_LPI2C4_SDA_SELECT_INPUT_GPIO_EMC_10_ALT2; // special case to select the pad involved in daisy chain
                    #endif
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_EMC_10, LPI2C4_SDA, (IOMUXC_SW_PAD_CTL_PAD_DSE_6 | IOMUXC_SW_PAD_CTL_PAD_SPEED_MEDIUM | PORT_ODE | IOMUXC_SW_PAD_CTL_PAD_PUS_22k_UP | IOMUXC_SW_PAD_CTL_PAD_PKE)); // LPI2C4_SDA on GPIO2-10 - alt function 2 [iMX LPI2C count 1..4]
                    #if defined IOMUXC_LPI2C4_SCL_SELECT_INPUT
        IOMUXC_LPI2C4_SCL_SELECT_INPUT = IOMUXC_LPI2C4_SCL_SELECT_INPUT_GPIO_EMC_11_ALT2; // special case to select the pad involved in daisy chain
                    #endif
        _CONFIG_PERIPHERAL_LOOPBACK(GPIO_EMC_11, LPI2C4_SCL, (IOMUXC_SW_PAD_CTL_PAD_DSE_6 | IOMUXC_SW_PAD_CTL_PAD_SPEED_MEDIUM | PORT_ODE | IOMUXC_SW_PAD_CTL_PAD_PUS_22k_UP | IOMUXC_SW_PAD_CTL_PAD_PKE)); // LPI2C4_SCL on GPIO2-11 - alt function 2 [iMX LPI2C count 1..4]        
                #endif
            #endif
        #endif
    }
    #endif
}

// Configure the LPI2C hardware
//
extern void fnConfigI2C(I2CTABLE *pars)
{
    KINETIS_LPI2C_CONTROL *ptrLPI2C;
    #if defined I2C_DMA_SUPPORT
    unsigned short usTriggerSource = 0;
    #endif
    if (pars->Channel == 0) {                                            // LPI2C channel 0 (LPI2C1 - i.MX RT)
    #if defined _iMX
        POWER_UP_ATOMIC(2, LPI2C1_CLOCK);                                // enable clock to module
    #else
        #if defined KINETIS_WITH_PCC
        SELECT_PCC_PERIPHERAL_SOURCE(LPI2C0, LPI2C0_PCC_SOURCE);         // select the PCC clock used by LPI2C0
        #endif
        POWER_UP_ATOMIC(4, I2C0);                                        // enable clock to module
    #endif
        ptrLPI2C = (KINETIS_LPI2C_CONTROL *)LPI2C0_BLOCK;
        LPI2C0_MCR = (LPI2C_MCR_RST | LPI2C_MCR_RTF | LPI2C_MCR_RRF);    // reset LPI2C controller and ensure FIFOs are reset
    #if defined irq_LPI2C0_ID
        fnEnterInterrupt(irq_LPI2C0_ID, PRIORITY_I2C0, _I2C_Interrupt_0);// enter I2C0 interrupt handler
    #else
        fnEnterInterrupt(irq_I2C0_ID, PRIORITY_I2C0, _I2C_Interrupt_0);  // enter I2C0 interrupt handler
    #endif
    #if defined _iMX
        #if defined iMX_RT105X || defined iMX_RT106X
        _CONFIG_PORT_INPUT(1, (PIN_GPIO_AD_B1_00_GPIO1_IO16 | PIN_GPIO_AD_B1_01_GPIO1_IO17), (PORT_ODE | PORT_PS_UP_ENABLE));
        #elif defined iMX_RT1011
        _CONFIG_PORT_INPUT(1, (PORT1_BIT27 | PORT1_BIT28), (PORT_ODE | PORT_PS_UP_ENABLE));
        #else
            #if defined iMX_RT102X && defined LPI2C1_ON_EMC
        _CONFIG_PORT_INPUT(2, (PIN_GPIO_EMC_02_GPIO2_IO02 | PIN_GPIO_EMC_03_GPIO2_IO03), (PORT_ODE | PORT_PS_UP_ENABLE));
            #else
        _CONFIG_PORT_INPUT(1, (PIN_GPIO_AD_B1_14_GPIO1_IO30 | PIN_GPIO_AD_B1_15_GPIO1_IO31), (PORT_ODE | PORT_PS_UP_ENABLE));
            #endif
        #endif
    #elif (defined KINETIS_KE15 || defined KINETIS_KE15 || defined KINETIS_KE16 || defined KINETIS_KE18) && defined I2C0_ON_B // initially configure as inputs with pull-up
        _CONFIG_PORT_INPUT(B, (PORTB_BIT6 | PORTB_BIT7), (PORT_ODE | PORT_PS_UP_ENABLE));
    #elif (defined KINETIS_KE15 || defined KINETIS_KE15 || defined KINETIS_KE16 || defined KINETIS_KE18)
        _CONFIG_PORT_INPUT(A, (PORTA_BIT2 | PORTA_BIT3), (PORT_ODE | PORT_PS_UP_ENABLE));
    #elif defined I2C0_E_LOW
        _CONFIG_PORT_INPUT_FAST_LOW(E, (PORTE_BIT18 | PORTE_BIT19), (PORT_ODE | PORT_PS_UP_ENABLE));
    #elif defined I2C0_B_LOW
        _CONFIG_PORT_INPUT_FAST_LOW(B, (PORTB_BIT1 | PORTB_BIT0), (PORT_ODE | PORT_PS_UP_ENABLE));
    #elif defined I2C0_B_HIGH
        _CONFIG_PORT_INPUT_FAST_LOW(B, (PORTB_BIT3 | PORTB_BIT2), (PORT_ODE | PORT_PS_UP_ENABLE));
    #elif defined I2C0_ON_C
        _CONFIG_PORT_INPUT_FAST_LOW(C, (PORTC_BIT9 | PORTC_BIT8), (PORT_ODE | PORT_PS_UP_ENABLE));
    #elif defined I2C0_D_LOW
        _CONFIG_PORT_INPUT_FAST_LOW(D, (PORTD_BIT9 | PORTD_BIT8), (PORT_ODE | PORT_PS_UP_ENABLE));
    #elif defined I2C0_D_HIGH
        _CONFIG_PORT_INPUT_FAST_LOW(D, (PORTD_BIT11 | PORTD_BIT10), (PORT_ODE | PORT_PS_UP_ENABLE));
    #else
        _CONFIG_PORT_INPUT_FAST_HIGH(E, (PORTE_BIT25 | PORTE_BIT24), (PORT_ODE | PORT_PS_UP_ENABLE));
    #endif
    #if defined I2C_DMA_SUPPORT
        usTriggerSource = DMAMUX0_CHCFG_SOURCE_LPI2C0_RX;
    #endif
    }
    #if LPI2C_AVAILABLE > 1
    else if (pars->Channel == 1) {                                       // LPI2C channel 1 (LPI2C2 - i.MX RT)
        #if defined _iMX
        POWER_UP_ATOMIC(2, LPI2C2_CLOCK);                                // enable clock to module
        #else
            #if defined KINETIS_WITH_PCC
        SELECT_PCC_PERIPHERAL_SOURCE(LPI2C1, LPI2C1_PCC_SOURCE);         // select the PCC clock used by LPI2C1
            #endif
        POWER_UP_ATOMIC(4, I2C1);                                        // enable clock to module
        #endif
        ptrLPI2C = (KINETIS_LPI2C_CONTROL *)LPI2C1_BLOCK;
        LPI2C1_MCR = (LPI2C_MCR_RST | LPI2C_MCR_RTF | LPI2C_MCR_RRF);    // reset LPI2C controller and ensure FIFOs are reset
        #if defined irq_LPI2C1_ID
        fnEnterInterrupt(irq_LPI2C1_ID, PRIORITY_I2C1, _I2C_Interrupt_1);// enter LPI2C1 interrupt handler
        #elif !defined irq_I2C1_ID && defined INTMUX0_AVAILABLE
        fnEnterInterrupt((irq_INTMUX0_0_ID + INTMUX_I2C1), INTMUX0_PERIPHERAL_I2C1, _I2C_Interrupt_1); // enter I2C1 interrupt handler based on INTMUX
        #else
        fnEnterInterrupt(irq_I2C1_ID, PRIORITY_I2C1, _I2C_Interrupt_1);  // enter I2C1 interrupt handler
        #endif
        #if defined _iMX
            #if defined iMX_RT105X || defined iMX_RT106X
        _CONFIG_PORT_INPUT(2, (PIN_GPIO_B0_04_GPIO2_IO04 | PIN_GPIO_B0_05_GPIO2_IO05), (PORT_ODE | PORT_PS_UP_ENABLE));
            #elif defined iMX_RT1011
        _CONFIG_PORT_INPUT(1, (PIN_GPIO_AD_08_GPIO1_IO22 | PIN_GPIO_AD_07_GPIO1_IO21), (PORT_ODE | PORT_PS_UP_ENABLE));
            #else
                #if defined iMX_RT102X && defined LPI2C2_ON_EMC
        _CONFIG_PORT_INPUT(2, (PIN_GPIO_EMC_18_GPIO2_IO18 | PIN_GPIO_EMC_19_GPIO2_IO19), (PORT_ODE | PORT_PS_UP_ENABLE));
                #else
        _CONFIG_PORT_INPUT(1, (PIN_GPIO_AD_B1_08_GPIO1_IO24 | PIN_GPIO_AD_B1_09_GPIO1_IO25), (PORT_ODE | PORT_PS_UP_ENABLE));
                #endif
            #endif
        #elif defined KINETIS_KE15 && defined I2C1_ON_D                  // initially configure as inputs with pull-up
        _CONFIG_PORT_INPUT(D, (PORTD_BIT8 | PORTD_BIT9), (PORT_ODE | PORT_PS_UP_ENABLE));
        #elif defined KINETIS_KE15
        _CONFIG_PORT_INPUT(E, (PORTE_BIT0 | PORTE_BIT1), (PORT_ODE | PORT_PS_UP_ENABLE));
        #elif defined I2C1_ON_A
        _CONFIG_PORT_INPUT_FAST_LOW(A, (PORTA_BIT4 | PORTA_BIT3), (PORT_ODE | PORT_PS_UP_ENABLE));
        #elif defined I2C1_C_LOW
        _CONFIG_PORT_INPUT_FAST_LOW(C, (PORTC_BIT2 | PORTC_BIT1), (PORT_ODE | PORT_PS_UP_ENABLE));
        #elif defined I2C1_C_HIGH
        _CONFIG_PORT_INPUT_FAST_LOW(C, (PORTC_BIT11 | PORTC_BIT10), (PORT_ODE | PORT_PS_UP_ENABLE));
        #else
        _CONFIG_PORT_INPUT_FAST_HIGH(E, (PORTE_BIT0 | PORTE_BIT1), (PORT_ODE | PORT_PS_UP_ENABLE));
        #endif
        #if defined I2C_DMA_SUPPORT
        usTriggerSource = DMAMUX0_CHCFG_SOURCE_LPI2C1_RX;
        #endif
    }
    #endif
    #if LPI2C_AVAILABLE > 2
    else if (pars->Channel == 2) {                                       // LPI2C channel 2 (LPI2C3 - i.MX RT)
        #if defined _iMX
        POWER_UP_ATOMIC(2, LPI2C3_CLOCK);                                // enable clock to module
        #else
            #if defined KINETIS_WITH_PCC
        SELECT_PCC_PERIPHERAL_SOURCE(LPI2C2, LPI2C2_PCC_SOURCE);         // select the PCC clock used by LPI2C1
            #endif
        POWER_UP_ATOMIC(1, I2C2);                                        // enable clock to module
        #endif
        ptrLPI2C = (KINETIS_LPI2C_CONTROL *)LPI2C2_BLOCK;
        LPI2C2_MCR = (LPI2C_MCR_RST | LPI2C_MCR_RTF | LPI2C_MCR_RRF);    // reset LPI2C controller and ensure FIFOs are reset
        #if !defined irq_LPI2C2_ID && defined INTMUX0_AVAILABLE
        fnEnterInterrupt((irq_INTMUX0_0_ID + INTMUX_LPI2C2), INTMUX0_PERIPHERAL_I2C2, _I2C_Interrupt_2); // enter I2C2 interrupt handler
        #else
        fnEnterInterrupt(irq_LPI2C2_ID, PRIORITY_I2C2, _I2C_Interrupt_2); // enter I2C2 interrupt handler
        #endif
        #if defined _iMX
            #if defined iMX_RT105X || defined iMX_RT106X
                #if defined LPI2C3_ON_EMC
        _CONFIG_PORT_INPUT(4, (PIN_GPIO_EMC_21_GPIO4_IO21 | PIN_GPIO_EMC_22_GPIO4_IO22), (PORT_ODE | PORT_PS_UP_ENABLE));
                #elif defined LPI2C3_ON_SD
        _CONFIG_PORT_INPUT(3, (PIN_GPIO_SD_B0_00_GPIO3_IO12 | PIN_GPIO_SD_B0_01_GPIO3_IO13), (PORT_ODE | PORT_PS_UP_ENABLE));
                #else
        _CONFIG_PORT_INPUT(1, (PIN_GPIO_AD_B1_06_GPIO1_IO22 | PIN_GPIO_AD_B1_07_GPIO1_IO23), (PORT_ODE | PORT_PS_UP_ENABLE));
                #endif
            #else
                #if defined iMX_RT102X && defined LPI2C3_ON_SD
        _CONFIG_PORT_INPUT(3, (PIN_GPIO_SD_B0_00_GPIO3_IO13 | PIN_GPIO_SD_B0_01_GPIO3_IO14), (PORT_ODE | PORT_PS_UP_ENABLE));
                #else
        _CONFIG_PORT_INPUT(1, (PIN_GPIO_AD_B0_08_GPIO1_IO08 | PIN_GPIO_AD_B0_09_GPIO1_IO09), (PORT_ODE | PORT_PS_UP_ENABLE));
                #endif
            #endif
        #elif defined I2C2_A_HIGH
        _CONFIG_PORT_INPUT_FAST_LOW(A, (PORTA_BIT13 | PORTA_BIT14), (PORT_ODE | PORT_PS_UP_ENABLE));
        #else
        _CONFIG_PORT_INPUT_FAST_HIGH(A, (PORTA_BIT11 | PORTA_BIT12), (PORT_ODE | PORT_PS_UP_ENABLE));
        #endif
        #if defined I2C_DMA_SUPPORT
        usTriggerSource = DMAMUX0_CHCFG_SOURCE_LPI2C2_RX;
        #endif
    }
    #endif
    #if LPI2C_AVAILABLE > 3
    else if (pars->Channel == 3) {                                       // LPI2C4 for i.MX RT
        POWER_UP_ATOMIC(6, LPI2C4_SERIAL_CLOCK);                         // enable clock to module
        ptrLPI2C = (KINETIS_LPI2C_CONTROL *)LPI2C3_BLOCK;
        LPI2C3_MCR = (LPI2C_MCR_RST | LPI2C_MCR_RTF | LPI2C_MCR_RRF);    // reset LPI2C controller and ensure FIFOs are reset
        fnEnterInterrupt(irq_LPI2C3_ID, PRIORITY_I2C3, _I2C_Interrupt_3);// enter I2C3 interrupt handler
        #if defined _iMX
            #if defined iMX_RT105X || defined iMX_RT106X
                #if defined I2C4_ON_4
        _CONFIG_PORT_INPUT(4, (PORT1_BIT11 | PORT1_BIT12), (PORT_ODE | PORT_PS_UP_ENABLE));
                #else
        _CONFIG_PORT_INPUT(1, (PORT1_BIT12 | PORT1_BIT13), (PORT_ODE | PORT_PS_UP_ENABLE));
                #endif
            #else
        _CONFIG_PORT_INPUT(3, (PORT3_BIT23 | PORT3_BIT22), (PORT_ODE | PORT_PS_UP_ENABLE));
            #endif
        #elif defined I2C2_A_HIGH
        _CONFIG_PORT_INPUT_FAST_LOW(A, (PORTA_BIT13 | PORTA_BIT14), (PORT_ODE | PORT_PS_UP_ENABLE));
        #else
        _CONFIG_PORT_INPUT_FAST_HIGH(A, (PORTA_BIT11 | PORTA_BIT12), (PORT_ODE | PORT_PS_UP_ENABLE));
        #endif
        #if defined I2C_DMA_SUPPORT
        usTriggerSource = DMAMUX0_CHCFG_SOURCE_LPI2C2_RX;
        #endif
    }
    #endif
    else {
        return;
    }
    ptrLPI2C->LPI2C_MDER = 0;                                            // disable DMA operation
    ptrLPI2C->LPI2C_MCR = (LPI2C_CHARACTERISTICS_);                      // take the LPI2C controller out of reset
    #if defined I2C_DMA_SUPPORT
    if ((pars->ucDMAConfig & I2C_TX_DMA) != 0) {
        ptrLPI2C->LPI2C_MDER = LPI2C_MDER_TDDE;                          // enable DMA on transmission
        fnConfigDMA_buffer(LPI2C_DMA_TX_CHANNEL[pars->Channel], (usTriggerSource + 1), 0, 0, (void *)&(ptrLPI2C->LPI2C_MTDR), (DMA_BYTES | DMA_DIRECTION_OUTPUT | DMA_SINGLE_CYCLE), _lpi2c_tx_dma_Interrupts[pars->Channel], LPI2C_DMA_TX_INT_PRIORITY[pars->Channel]);
    }
    if ((pars->ucDMAConfig & I2C_RX_DMA) != 0) {
        ptrLPI2C->LPI2C_MDER |= LPI2C_MDER_RDDE;                         // enable DMA on reception
        fnConfigDMA_buffer(LPI2C_DMA_RX_CHANNEL[pars->Channel], (usTriggerSource), 0, (void *)&(ptrLPI2C->LPI2C_MRDR), 0, (DMA_BYTES | DMA_DIRECTION_INPUT | DMA_SINGLE_CYCLE), _lpi2c_rx_dma_Interrupts[pars->Channel], LPI2C_DMA_RX_INT_PRIORITY[pars->Channel]);
    }
    #endif
    if (pars->usSpeed != 0) {
        int iPrecaler;
        int iClkHiCycle;
        unsigned char ucPrescalerSetting = 0;
        #if defined _iMX
        unsigned long ulPrescaledClock = LPI2C_CLK_ROOT_FREQUENCY;
        #else
        unsigned long ulPrescaledClock = MCGOUTCLK;                      // assumed running from HIRC
        #endif
        unsigned long ulDesiredSpeed = (pars->usSpeed * 1000);           // desired I2C speed in Hz
        unsigned char ucClkHi = 0;
        unsigned long ulAbsoluteDeviation;
        unsigned long ulBestDeviation = 0xffffffff;
        unsigned long ulI2C_speed;
        // Baud rate = (sourceClock_Hz/2^iPrecaler)/(CLKLO+1+CLKHI+1 + ROUNDDOWN((2+FILTSCL)/2^iPrecaler)
        // Assume CLKLO = 2*CLKHI, SETHOLD = CLKHI, DATAVD = CLKHI/2
        // - this calculation is based on the NXP reference
        //
        for (iPrecaler = 1; (iPrecaler <= 128); iPrecaler *= 2) {        // attempt with all possible prescaler values
            for (iClkHiCycle = 1; iClkHiCycle < 32; iClkHiCycle++) {     // attempt with all possible high cycle values
                if (iClkHiCycle == 1) {
                    ulI2C_speed = (ulPrescaledClock / (1 + 3 + 2 + (2/iPrecaler))); // the I2C frequency that this combination gives
                }
                else {
                    ulI2C_speed = (ulPrescaledClock / ((3 * iClkHiCycle) + 2 + (2/iPrecaler))); // the I2C frequency that this combination gives
                }

                if (ulDesiredSpeed >= ulI2C_speed) {                     // absolute deviation from desired frequency
                    ulAbsoluteDeviation = (ulDesiredSpeed - ulI2C_speed);
                }
                else {
                    ulAbsoluteDeviation = (ulI2C_speed - ulDesiredSpeed);
                }

