sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_LPI2C.h
                if (ulAbsoluteDeviation < ulBestDeviation) {             // if this setting is the best that has been found yet
                    ptrLPI2C->LPI2C_MCFGR1 = (ucPrescalerSetting | LPI2C_MCFGR1_IGNACK | LPI2C_MCFGR1_PINCFG_2_OPEN); // {1} set the clock prescaler and normal I2C mode (2-line with open drain) - ignore nacks
                    ucClkHi = (unsigned char)iClkHiCycle;
                    if (ulAbsoluteDeviation == 0) {
                        break;                                           // in case a pefect combination has been found we can quit searching
                    }
                    ulBestDeviation = ulAbsoluteDeviation;               // new closest settings
                }
            }
            ulPrescaledClock /= 2;
            ucPrescalerSetting++;
        }

        if (ucClkHi < 2) {
            ptrLPI2C->LPI2C_MCCR0 = (((ucClkHi << LPI2C_MCCR_CLKHI_SHIFT) & LPI2C_MCCR0_CLKHI_MASK) | (((3 << LPI2C_MCCR_CLKLO_SHIFT) & LPI2C_MCCR0_CLKLO_MASK) | ((2 << LPI2C_MCCR_SETHOLD_SHIFT) & LPI2C_MCCR0_SETHOLD_MASK) | ((1 << LPI2C_MCCR_DATAVD_SHIFT) & LPI2C_MCCR0_DATAVD_MASK)));
        }
        else {
            ptrLPI2C->LPI2C_MCCR0 = (((ucClkHi << LPI2C_MCCR_CLKHI_SHIFT) & LPI2C_MCCR0_CLKHI_MASK) | ((((2 * ucClkHi) << LPI2C_MCCR_CLKLO_SHIFT) & LPI2C_MCCR0_CLKLO_MASK) | ((ucClkHi << LPI2C_MCCR_SETHOLD_SHIFT) & LPI2C_MCCR0_SETHOLD_MASK) | (((ucClkHi/2) << LPI2C_MCCR_DATAVD_SHIFT) & LPI2C_MCCR0_DATAVD_MASK)));
        }
      //ptrLPI2C->LPI2C_MCCR0 = 0x09131326;                              // reference for 100kHz from 48MHz clock (prescale value of 3)
        ptrLPI2C->LPI2C_MCR = (LPI2C_MCR_MEN | LPI2C_CHARACTERISTICS_);  // enable master mode of operation
    }
    else {
    #if defined I2C_SLAVE_MODE
        ucSpeed = 0;                                                     // speed is determined by master
        ptrLPI2C->I2C_A1 = pars->ucSlaveAddress;                         // program the slave's address
        fnConfigLPI2C_pins(pars->Channel, 0);                            // configure pins for LPI2C use
        I2C_rx_control[pars->Channel]->ucState = I2C_SLAVE_RX_MESSAGE_MODE; // the slave receiver operates in message mode
        I2C_tx_control[pars->Channel]->ucState = I2C_SLAVE_TX_BUFFER_MODE; // the slave transmitter operates in buffer mode
        fnI2C_SlaveCallback[pars->Channel] = pars->fnI2C_SlaveCallback;  // optional callback to use on slave reception

        ptrLPI2C->I2C_C1 |= I2C_IIEN;                                    // immediately enable interrupts if operating as a slave
    #if defined DOUBLE_BUFFERED_I2C || defined I2C_START_CONDITION_INTERRUPT
        ptrLPI2C->I2C_FLT = I2C_FLT_FLT_SSIE;                            // enable start/stop condition interrupt
    #else
        ptrLPI2C->I2C_FLT = I2C_FLT_FLT_STOPIE;                          // enable stop condition interrupt
    #endif
    #else
        _EXCEPTION("I2C slave mode not enabled!");
    #endif
    }
    #if defined _WINDOWS
    fnConfigSimI2C(pars->Channel, (pars->usSpeed * 1000));               // inform the simulator of the I2C speed that has been set
    #endif
}

